console.log('1');

setTimeout(function () {
  console.log('2')
}, 0);

Promise.resolve().then(() => console.log('3'));

console.log('4');

// Результатом будет 1, 4, 3, 2, потому что код выполняется асинхронно. Браузер читает код так:
// -console.log('1') - выполнить и показать в консоли, потому что операция выполняется синхронно (ничего особенного)
// — Функция setTimeout — считывает и записывает, но не показывает в консоли, потому что это операция, которая выполняется асинхронно и требует обработки, так как взаимодействует с веб-API.
// -Promise — считывает и записывает, но не показывает в консоли, потому что это операция, которая также выполняется асинхронно в ожидании ответа
// -console.log('4') - выполняется и отображается в консоли, поскольку операция выполняется синхронно.
// В заключение: первый раз будет отображаться 1, 4, затем будет отображаться результат от Promise, затем будет отображаться функция setTimeout, потому что она взаимодействует с Web API и требует обработки